// 每个角色翻译隔开一下
const translates = {
	poqun_jiyi: "记忆",
	rixun: "日询",
	rixun_info:
		"出牌阶段限一次，你将一张手牌交给一名其他角色，若如此做，该角色回合开始时须选择一项:1·跳过摸牌阶段，此回合使用【杀】伤害+1；2.跳过出牌阶段，回复1点体力。",
	moyu: "摸鱼",
	moyu_info: "一名角色回合结束后，若其回合内没有使用【杀】，你可以摸一张牌。",
	yuyu: "玉玉",
	yuyu_info:
		"当你受到伤害后，你可以记录伤害牌的花色。锁定技，本回合与此法记录的花色相同的牌对你造成伤害取消之。",

	poqun_xiaoche: "小澈",
	tuhao: "土豪",
	tuhao_info:
		"其他角色出牌阶段限一次，当其需要使用一张基本牌并指定目标后，可询问你是否帮其使用。若如此做，其当前回合手牌上限-1。你代其使用牌后，其出牌阶段结束时，若其于此阶段:回复过体力，你获得其装备区的防具并装备之；造成过伤害，你摸一张牌。",
	ziyi: "资医",
	ziyi_info: "当你受到伤害时，你可以弃置一张与伤害牌类型一致的牌，令此伤害-1。",
	guangming: "光明",
	guangming_info: "若你装备区没有防具牌，视为装备了白银狮子。",

	poqun_xiaoqi: "小奇",
	maihao: "买号",
	maihao_info:
		"每轮限一次，一名角色阵亡结算后，你可以保留【买号】将武将将面替换成该角色武将，然后弃置区域内的全部牌，并摸X张牌(X为你替换后的体力上限）",
	shenyin: "神隐",
	shenyin_info: "锁定技，你不能成为兵粮寸断的目标，其他角色计算与你的距离+1。",
};

export default translates;
