// 每个角色翻译隔开一下
const translates = {
	poqun_jiyi: "记忆",
	rixun: "日询",
	rixun_info:
		"出牌阶段限一次，你可以将一张手牌交给一名其他角色。该角色在其回合开始时须选择一项：1.跳过摸牌阶段，本回合使用【杀】伤害+1；2.跳过出牌阶段，回复1点体力。",
	moyu: "摸鱼",
	moyu_info: "一名角色回合结束后，若其回合内没有使用牌，你可以摸一张牌。",
	yuyu: "玉玉",
	yuyu_info:
		"当你受到伤害后，记录该伤害牌的花色。直到你的下回合准备阶段，与以此法记录的花色相同的牌对你造成的伤害取消之。",

	poqun_xiaoche: "小澈",
	tuhao: "土豪",
	tuhao_info:
		"其他角色出牌阶段限一次，当其需要使用一张基本牌时，你可以代为使用。若如此做，其当前回合手牌上限-1；其出牌阶段结束时，若其于此阶段：回复体力，你弃置一张牌；造成伤害，你摸一张牌。",
	ziyi: "资医",
	ziyi_info:
		"当你受到牌造成的伤害时，你可以弃置一张牌，若此牌与造成此伤害的牌类型一致，令此伤害-1。",
	guangming: "光明",
	guangming_info: "锁定技，若你的防具栏内没有牌且没有被废除，则你视为装备着【八卦阵】。",
};

export default translates;
